src/object-diagram/logic/test-suites/miscellaneous/tests/full/writer/expected.gv
digraph ObjectDiagram {
  node [shape=plaintext]
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;[StackFrame]&gt;&gt;</i></td></th>
    <tr><td align="left">borderWidth</td><td align="left" port="borderWidth">3 (int)</td></tr>
    <tr><td align="left">topLeft</td><td align="left" port="topLeft">null</td></tr>
    <tr><td align="left">pNull</td><td align="left" port="pNull">null</td></tr>
    <tr><td align="left">args</td><td align="left" port="args"></td></tr>
    <tr><td align="left">topLeftCopy</td><td align="left" port="topLeftCopy"></td></tr>
    <tr><td align="left">bottomRight</td><td align="left" port="bottomRight"></td></tr>
    <tr><td align="left">background</td><td align="left" port="background"></td></tr>
    <tr><td align="left">border</td><td align="left" port="border"></td></tr>
    <tr><td align="left">text</td><td align="left" port="text"></td></tr>
    <tr><td align="left">rect</td><td align="left" port="rect"></td></tr>
    <tr><td align="left">map</td><td align="left" port="map"></td></tr>
    <tr><td align="left">intArray</td><td align="left" port="intArray"></td></tr>
    <tr><td align="left">stringArray</td><td align="left" port="stringArray"></td></tr>
    <tr><td align="left">points</td><td align="left" port="points"></td></tr>
  </table>>]
  _bdb37fd1fa1b13d2c62e42aa9a27afaa093a1889 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String[]&gt;&gt;</i></td></th>
    <tr><td colspan="2">[]</td></tr>
  </table>>]
  _3fb27fbe48150f15f1c717154e8b2838635ef4ae [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;Point&gt;&gt;</i></td></th>
    <tr><td align="left">x</td><td align="left" port="x">42 (int)</td></tr>
    <tr><td align="left">y</td><td align="left" port="y">1 (int)</td></tr>
  </table>>]
  _a6ed3c1901ccfa2adffe839bb7b830200a6393ef [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;Point&gt;&gt;</i></td></th>
    <tr><td align="left">x</td><td align="left" port="x">5 (int)</td></tr>
    <tr><td align="left">y</td><td align="left" port="y">7 (int)</td></tr>
  </table>>]
  _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;Color&gt;&gt;</i></td></th>
    <tr><td align="left">ordinal</td><td align="left" port="ordinal">2 (int)</td></tr>
    <tr><td align="left">hexValue</td><td align="left" port="hexValue"></td></tr>
    <tr><td align="left">name</td><td align="left" port="name"></td></tr>
    <tr><td align="left">textValue</td><td align="left" port="textValue"></td></tr>
  </table>>]
  _9c04b7d66febb3f9b9860ba0795ec96cd00ebd7b [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"#0000FF"</td></tr>
  </table>>]
  _998c19af6e8387e89fb44a945734ec829e663b43 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"BLUE"</td></tr>
  </table>>]
  _c8f291339090d790de0913e8078a801c796e0248 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"blue"</td></tr>
  </table>>]
  _974a0f2d033c9fcc489e835fde8908db6a8ffb17 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;Color&gt;&gt;</i></td></th>
    <tr><td align="left">ordinal</td><td align="left" port="ordinal">1 (int)</td></tr>
    <tr><td align="left">hexValue</td><td align="left" port="hexValue"></td></tr>
    <tr><td align="left">name</td><td align="left" port="name"></td></tr>
    <tr><td align="left">textValue</td><td align="left" port="textValue"></td></tr>
  </table>>]
  _6513eb7336cb77040da38112a94686c4cdfc1607 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"#00FF00"</td></tr>
  </table>>]
  _481d93b92603bf4e6e55ca8891db71a1da7006fa [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"GREEN"</td></tr>
  </table>>]
  _e5a403d2671b9d13666e19f6043ce08954ad7a93 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"green"</td></tr>
  </table>>]
  _fbdaf54b6dbf15b4c6d6bd83657537997479c998 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"topLeft"</td></tr>
  </table>>]
  _a7ef8c9b8666e11b9a290d26d9ecba5100a36a2d [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;Rectangle&gt;&gt;</i></td></th>
    <tr><td align="left">borderWidth</td><td align="left" port="borderWidth">3 (int)</td></tr>
    <tr><td align="left">topLeft</td><td align="left" port="topLeft">null</td></tr>
    <tr><td align="left">bottomRight</td><td align="left" port="bottomRight"></td></tr>
    <tr><td align="left">backgroundColor</td><td align="left" port="backgroundColor"></td></tr>
    <tr><td align="left">borderColor</td><td align="left" port="borderColor"></td></tr>
    <tr><td align="left">text</td><td align="left" port="text"></td></tr>
  </table>>]
  _305ce90efc792b2616442e67c2a982b762a53ea1 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;HashMap&gt;&gt;</i></td></th>
    <tr><td align="left">0</td><td align="left" port="0"></td></tr>
    <tr><td align="left">1</td><td align="left" port="1"></td></tr>
    <tr><td align="left">2</td><td align="left" port="2"></td></tr>
  </table>>]
  _d72423b2e32100781060e9dbcadb1726c415d8b6 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;HashMap$Node&gt;&gt;</i></td></th>
    <tr><td align="left">value</td><td align="left" port="value">null</td></tr>
    <tr><td align="left">key</td><td align="left" port="key"></td></tr>
  </table>>]
  _4468ba2744623f2b161cf71c3f33bf34c36957e9 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"top left"</td></tr>
  </table>>]
  _d34de9314d56ec12f3d2aaf5b51868d660f4e148 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;HashMap$Node&gt;&gt;</i></td></th>
    <tr><td align="left">value</td><td align="left" port="value">null</td></tr>
    <tr><td align="left">key</td><td align="left" port="key"></td></tr>
  </table>>]
  _c3e6011325e16486c70a59186b6908448cd76e5d [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"middle"</td></tr>
  </table>>]
  _c1b1e0ff8e344a816f12ec5d11e527a3085219c6 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;HashMap$Node&gt;&gt;</i></td></th>
    <tr><td align="left">value</td><td align="left" port="value"></td></tr>
    <tr><td align="left">key</td><td align="left" port="key"></td></tr>
  </table>>]
  _b7a9be3f2325ed4f44e5e4126aa64169f66fcd93 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String&gt;&gt;</i></td></th>
    <tr><td colspan="2">"bottom right"</td></tr>
  </table>>]
  _c2190a17eb819df74fe6c05aed316fd1544a4e29 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;int[]&gt;&gt;</i></td></th>
    <tr><td colspan="2">[2,3,5,7,11,13,17,19,23,29,…]</td></tr>
  </table>>]
  _03159dd871b813f740c37c20d0b948aba1fbf408 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;String[]&gt;&gt;</i></td></th>
    <tr><td colspan="2">["one","two"]</td></tr>
  </table>>]
  _238e5fd2037166644245b9322a12f59898950d0a [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;Point[]&gt;&gt;</i></td></th>
    <tr><td align="left">2</td><td align="left" port="2">null</td></tr>
    <tr><td align="left">1</td><td align="left" port="1"></td></tr>
    <tr><td align="left">0</td><td align="left" port="0"></td></tr>
  </table>>]
  _32ecf3f2055354b1c3bc249a7e8301cbf5cfc944 [label=<<table border="0" cellborder="1" cellspacing="0">
    <th><td colspan="2"><i>&lt;&lt;Point&gt;&gt;</i></td></th>
    <tr><td align="left">x</td><td align="left" port="x">1337 (int)</td></tr>
    <tr><td align="left">y</td><td align="left" port="y">7331 (int)</td></tr>
  </table>>]
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:args -> _bdb37fd1fa1b13d2c62e42aa9a27afaa093a1889
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:topLeftCopy -> _3fb27fbe48150f15f1c717154e8b2838635ef4ae
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:bottomRight -> _a6ed3c1901ccfa2adffe839bb7b830200a6393ef
  _a7ef8c9b8666e11b9a290d26d9ecba5100a36a2d:bottomRight -> _a6ed3c1901ccfa2adffe839bb7b830200a6393ef
  _c1b1e0ff8e344a816f12ec5d11e527a3085219c6:value -> _a6ed3c1901ccfa2adffe839bb7b830200a6393ef
  _238e5fd2037166644245b9322a12f59898950d0a:1 -> _a6ed3c1901ccfa2adffe839bb7b830200a6393ef
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:background -> _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b
  _a7ef8c9b8666e11b9a290d26d9ecba5100a36a2d:backgroundColor -> _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b
  _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b:hexValue -> _9c04b7d66febb3f9b9860ba0795ec96cd00ebd7b
  _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b:name -> _998c19af6e8387e89fb44a945734ec829e663b43
  _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b:textValue -> _c8f291339090d790de0913e8078a801c796e0248
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:border -> _974a0f2d033c9fcc489e835fde8908db6a8ffb17
  _a7ef8c9b8666e11b9a290d26d9ecba5100a36a2d:borderColor -> _974a0f2d033c9fcc489e835fde8908db6a8ffb17
  _974a0f2d033c9fcc489e835fde8908db6a8ffb17:hexValue -> _6513eb7336cb77040da38112a94686c4cdfc1607
  _974a0f2d033c9fcc489e835fde8908db6a8ffb17:name -> _481d93b92603bf4e6e55ca8891db71a1da7006fa
  _974a0f2d033c9fcc489e835fde8908db6a8ffb17:textValue -> _e5a403d2671b9d13666e19f6043ce08954ad7a93
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:text -> _fbdaf54b6dbf15b4c6d6bd83657537997479c998
  _a7ef8c9b8666e11b9a290d26d9ecba5100a36a2d:text -> _fbdaf54b6dbf15b4c6d6bd83657537997479c998
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:rect -> _a7ef8c9b8666e11b9a290d26d9ecba5100a36a2d
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:map -> _305ce90efc792b2616442e67c2a982b762a53ea1
  _305ce90efc792b2616442e67c2a982b762a53ea1:0 -> _d72423b2e32100781060e9dbcadb1726c415d8b6
  _d72423b2e32100781060e9dbcadb1726c415d8b6:key -> _4468ba2744623f2b161cf71c3f33bf34c36957e9
  _305ce90efc792b2616442e67c2a982b762a53ea1:1 -> _d34de9314d56ec12f3d2aaf5b51868d660f4e148
  _d34de9314d56ec12f3d2aaf5b51868d660f4e148:key -> _c3e6011325e16486c70a59186b6908448cd76e5d
  _305ce90efc792b2616442e67c2a982b762a53ea1:2 -> _c1b1e0ff8e344a816f12ec5d11e527a3085219c6
  _c1b1e0ff8e344a816f12ec5d11e527a3085219c6:key -> _b7a9be3f2325ed4f44e5e4126aa64169f66fcd93
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:intArray -> _c2190a17eb819df74fe6c05aed316fd1544a4e29
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:stringArray -> _03159dd871b813f740c37c20d0b948aba1fbf408
  _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352:points -> _238e5fd2037166644245b9322a12f59898950d0a
  _238e5fd2037166644245b9322a12f59898950d0a:0 -> _32ecf3f2055354b1c3bc249a7e8301cbf5cfc944
}
