src/object-diagram/logic/test-suites/miscellaneous/tests/full/writer/expected.puml
@startuml
map "<<[StackFrame]>>" as _0f07b6f2a31cbd2e26428c51e8660b0dffe6e352 {
  borderWidth => 3 (int)
  topLeft => null
  pNull => null
  args =>
  topLeftCopy =>
  bottomRight =>
  background =>
  border =>
  text =>
  rect =>
  map =>
  intArray =>
  stringArray =>
  points =>
}
object "<<String[]>>" as _bdb37fd1fa1b13d2c62e42aa9a27afaa093a1889 {
  []
}
map "<<Point>>" as _3fb27fbe48150f15f1c717154e8b2838635ef4ae {
  x => 42 (int)
  y => 1 (int)
}
map "<<Point>>" as _a6ed3c1901ccfa2adffe839bb7b830200a6393ef {
  x => 5 (int)
  y => 7 (int)
}
map "<<Color>>" as _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b {
  ordinal => 2 (int)
  hexValue =>
  name =>
  textValue =>
}
object "<<String>>" as _9c04b7d66febb3f9b9860ba0795ec96cd00ebd7b {
  "#0000FF"
}
object "<<String>>" as _998c19af6e8387e89fb44a945734ec829e663b43 {
  "BLUE"
}
object "<<String>>" as _c8f291339090d790de0913e8078a801c796e0248 {
  "blue"
}
map "<<Color>>" as _974a0f2d033c9fcc489e835fde8908db6a8ffb17 {
  ordinal => 1 (int)
  hexValue =>
  name =>
  textValue =>
}
object "<<String>>" as _6513eb7336cb77040da38112a94686c4cdfc1607 {
  "#00FF00"
}
object "<<String>>" as _481d93b92603bf4e6e55ca8891db71a1da7006fa {
  "GREEN"
}
object "<<String>>" as _e5a403d2671b9d13666e19f6043ce08954ad7a93 {
  "green"
}
object "<<String>>" as _fbdaf54b6dbf15b4c6d6bd83657537997479c998 {
  "topLeft"
}
map "<<Rectangle>>" as _a7ef8c9b8666e11b9a290d26d9ecba5100a36a2d {
  borderWidth => 3 (int)
  topLeft => null
  bottomRight =>
  backgroundColor =>
  borderColor =>
  text =>
}
map "<<HashMap>>" as _305ce90efc792b2616442e67c2a982b762a53ea1 {
  0 =>
  1 =>
  2 =>
}
map "<<HashMap$Node>>" as _d72423b2e32100781060e9dbcadb1726c415d8b6 {
  value => null
  key =>
}
object "<<String>>" as _4468ba2744623f2b161cf71c3f33bf34c36957e9 {
  "top left"
}
map "<<HashMap$Node>>" as _d34de9314d56ec12f3d2aaf5b51868d660f4e148 {
  value => null
  key =>
}
object "<<String>>" as _c3e6011325e16486c70a59186b6908448cd76e5d {
  "middle"
}
map "<<HashMap$Node>>" as _c1b1e0ff8e344a816f12ec5d11e527a3085219c6 {
  value =>
  key =>
}
object "<<String>>" as _b7a9be3f2325ed4f44e5e4126aa64169f66fcd93 {
  "bottom right"
}
object "<<int[]>>" as _c2190a17eb819df74fe6c05aed316fd1544a4e29 {
  [2,3,5,7,11,13,17,19,23,29,…]
}
object "<<String[]>>" as _03159dd871b813f740c37c20d0b948aba1fbf408 {
  ["one","two"]
}
map "<<Point[]>>" as _238e5fd2037166644245b9322a12f59898950d0a {
  2 => null
  1 =>
  0 =>
}
map "<<Point>>" as _32ecf3f2055354b1c3bc249a7e8301cbf5cfc944 {
  x => 1337 (int)
  y => 7331 (int)
}
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::args ==> _bdb37fd1fa1b13d2c62e42aa9a27afaa093a1889
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::topLeftCopy ==> _3fb27fbe48150f15f1c717154e8b2838635ef4ae
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::bottomRight ==> _a6ed3c1901ccfa2adffe839bb7b830200a6393ef
_a7ef8c9b8666e11b9a290d26d9ecba5100a36a2d::bottomRight ==> _a6ed3c1901ccfa2adffe839bb7b830200a6393ef
_c1b1e0ff8e344a816f12ec5d11e527a3085219c6::value ==> _a6ed3c1901ccfa2adffe839bb7b830200a6393ef
_238e5fd2037166644245b9322a12f59898950d0a::1 ==> _a6ed3c1901ccfa2adffe839bb7b830200a6393ef
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::background ==> _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b
_a7ef8c9b8666e11b9a290d26d9ecba5100a36a2d::backgroundColor ==> _997cc01d7a247aeedb702fa90f2b9ab4ef820a7b
_997cc01d7a247aeedb702fa90f2b9ab4ef820a7b::hexValue ==> _9c04b7d66febb3f9b9860ba0795ec96cd00ebd7b
_997cc01d7a247aeedb702fa90f2b9ab4ef820a7b::name ==> _998c19af6e8387e89fb44a945734ec829e663b43
_997cc01d7a247aeedb702fa90f2b9ab4ef820a7b::textValue ==> _c8f291339090d790de0913e8078a801c796e0248
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::border ==> _974a0f2d033c9fcc489e835fde8908db6a8ffb17
_a7ef8c9b8666e11b9a290d26d9ecba5100a36a2d::borderColor ==> _974a0f2d033c9fcc489e835fde8908db6a8ffb17
_974a0f2d033c9fcc489e835fde8908db6a8ffb17::hexValue ==> _6513eb7336cb77040da38112a94686c4cdfc1607
_974a0f2d033c9fcc489e835fde8908db6a8ffb17::name ==> _481d93b92603bf4e6e55ca8891db71a1da7006fa
_974a0f2d033c9fcc489e835fde8908db6a8ffb17::textValue ==> _e5a403d2671b9d13666e19f6043ce08954ad7a93
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::text ==> _fbdaf54b6dbf15b4c6d6bd83657537997479c998
_a7ef8c9b8666e11b9a290d26d9ecba5100a36a2d::text ==> _fbdaf54b6dbf15b4c6d6bd83657537997479c998
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::rect ==> _a7ef8c9b8666e11b9a290d26d9ecba5100a36a2d
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::map ==> _305ce90efc792b2616442e67c2a982b762a53ea1
_305ce90efc792b2616442e67c2a982b762a53ea1::0 ==> _d72423b2e32100781060e9dbcadb1726c415d8b6
_d72423b2e32100781060e9dbcadb1726c415d8b6::key ==> _4468ba2744623f2b161cf71c3f33bf34c36957e9
_305ce90efc792b2616442e67c2a982b762a53ea1::1 ==> _d34de9314d56ec12f3d2aaf5b51868d660f4e148
_d34de9314d56ec12f3d2aaf5b51868d660f4e148::key ==> _c3e6011325e16486c70a59186b6908448cd76e5d
_305ce90efc792b2616442e67c2a982b762a53ea1::2 ==> _c1b1e0ff8e344a816f12ec5d11e527a3085219c6
_c1b1e0ff8e344a816f12ec5d11e527a3085219c6::key ==> _b7a9be3f2325ed4f44e5e4126aa64169f66fcd93
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::intArray ==> _c2190a17eb819df74fe6c05aed316fd1544a4e29
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::stringArray ==> _03159dd871b813f740c37c20d0b948aba1fbf408
_0f07b6f2a31cbd2e26428c51e8660b0dffe6e352::points ==> _238e5fd2037166644245b9322a12f59898950d0a
_238e5fd2037166644245b9322a12f59898950d0a::0 ==> _32ecf3f2055354b1c3bc249a7e8301cbf5cfc944
@enduml
